OpenAtomFoundation/TobudOS/board/STM8L052R8T6/LIB/inc/stm8l15x.h
/*----------------------------------------------------------------------------*/
/**
  * @brief LCD Controller (LCD)
  */
typedef struct LCD_struct
{
  __IO uint8_t CR1;      /*!< LCD control register 1 */
  __IO uint8_t CR2;      /*!< LCD control register 2 */
  __IO uint8_t CR3;      /*!< LCD control register 3 */
  __IO uint8_t FRQ;      /*!< LCD frequency register */
  __IO uint8_t PM[6];    /*!< LCD portmask registers*/
  uint8_t RESERVED1[2];  /*!< Reserved */
  __IO uint8_t RAM[22];  /*!< LCD RAM registers*/
  uint8_t RESERVED2[13]; /*!< Reserved */
  __IO uint8_t CR4;      /*!< LCD control register 4 */
}
LCD_TypeDef;
/** @addtogroup LCD_Registers_Reset_Value
  * @{
  */
#define LCD_CR1_RESET_VALUE    ((uint8_t)0x00) /*!< Control Register 1 reset value */
#define LCD_CR2_RESET_VALUE    ((uint8_t)0x00) /*!< Control Register 2 reset value */
#define LCD_CR3_RESET_VALUE    ((uint8_t)0x00) /*!< Control Register 3 reset value */
#define LCD_FRQ_RESET_VALUE    ((uint8_t)0x00) /*!< Register Frequency reset value */
#define LCD_PM_RESET_VALUE     ((uint8_t)0x00) /*!< Port mask Register reset value */
#define LCD_RAM_RESET_VALUE    ((uint8_t)0x00) /*!< RAM Register reset value       */
#define LCD_CR4_RESET_VALUE    ((uint8_t)0x00) /*!< Control Register 4 reset value */


/**
* @}
*/

/** @addtogroup LCD_Registers_Bits_Definition
  * @{
  */
#define LCD_CR1_BLINK    ((uint8_t)0xC0) /*!< Blink bits mask           */
#define LCD_CR1_BLINKF   ((uint8_t)0x38) /*!< Blink frequency bits mask */
#define LCD_CR1_DUTY     ((uint8_t)0x06) /*!< Duty bits mask            */
#define LCD_CR1_B2       ((uint8_t)0x01) /*!< Bias selector bit mask    */


#define LCD_CR2_PON      ((uint8_t)0xE0) /*!< Pulse on duration bits mask */
#define LCD_CR2_HD       ((uint8_t)0x10) /*!< High drive enable bit mask  */
#define LCD_CR2_CC       ((uint8_t)0x0E) /*!< Contrast control bits mask  */
#define LCD_CR2_VSEL     ((uint8_t)0x01) /*!< Voltage source bit mask     */

#define LCD_CR3_LCDEN    ((uint8_t)0x40) /*!< Enable bit mask           */
#define LCD_CR3_SOFIE    ((uint8_t)0x20) /*!< Start of frame interrupt enable mask */
#define LCD_CR3_SOF      ((uint8_t)0x10) /*!< Start of frame bit mask              */
#define LCD_CR3_SOFC     ((uint8_t)0x08) /*!< Clear start of frame bit mask        */
#define LCD_CR3_DEAD     ((uint8_t)0x07) /*!< DEAD time bits mask                  */

#define LCD_FRQ_DIV      ((uint8_t)0x0F) /*!< Divider bits mask */
#define LCD_FRQ_PS       ((uint8_t)0xF0) /*!< 16 bits prescaler bits mask */

#define LCD_CR4_MAPCOM   ((uint8_t)0x08) /*!< Select the mapping scheme for the COM[7:4] */
#define LCD_CR4_PAGECOM  ((uint8_t)0x04) /*!< Select the LCD RAM page sector */
#define LCD_CR4_DUTY8    ((uint8_t)0x02) /*!< Enable the 1/8 duty */
#define LCD_CR4_B4       ((uint8_t)0x01) /*!< Enable the 1/4 bias */


/**
  * @}
  */

/*----------------------------------------------------------------------------*/
/* This peripheral is avilable in STM8L16x devices only*/
/**
  * @brief AES tiny (AES)
  */
typedef struct AES_struct
{
  __IO uint8_t CR;      /*!< AES control register     */
  __IO uint8_t SR;      /*!< AES status register      */
  __IO uint8_t DINR;    /*!< AES Data input register  */
  __IO uint8_t DOUTR;   /*!< AES Data output register */
}
AES_TypeDef;

/** @addtogroup AES_Registers_Reset_Value
  * @{
  */
#define AES_CR_RESET_VALUE    ((uint8_t)0x00) /*!< Control Register reset value     */
#define AES_SR_RESET_VALUE    ((uint8_t)0x00) /*!< Status Register reset value      */
#define AES_DINR_RESET_VALUE  ((uint8_t)0x00) /*!< Data input register reset value  */
#define AES_DOUTR_RESET_VALUE ((uint8_t)0x00) /*!< Data output register reset value */
/**
* @}
*/

/** @addtogroup AES_Registers_Bits_Definition
  * @{
  */
#define AES_CR_DMAEN  ((uint8_t)0x80) /*!< DMA Enable bit mask */
#define AES_CR_ERRIE  ((uint8_t)0x40) /*!< Error Interrupt Enable bit mask */
#define AES_CR_CCIE   ((uint8_t)0x20) /*!< Computation Complete Interrupt Enable bit mask */
#define AES_CR_ERRC   ((uint8_t)0x10) /*!< Error Clear bit mask  */
#define AES_CR_CCFC   ((uint8_t)0x08) /*!< Computation Complete Flag Clear bit mask */
#define AES_CR_MODE   ((uint8_t)0x06) /*!< AES Modes of Operation bits mask */
#define AES_CR_EN     ((uint8_t)0x01) /*!< AES Enable bit mask */

#define AES_SR_WRERR  ((uint8_t)0x04) /*!< Write Error Flag bit mask */
#define AES_SR_RDERR  ((uint8_t)0x02) /*!< Read Error Flag bit mask */
#define AES_SR_CCF    ((uint8_t)0x01) /*!< Computation Complete Flag bit mask */

#define AES_DINR      ((uint8_t)0xFF) /*!< Data Input bits mask */
#define AES_DOUTR     ((uint8_t)0xFF) /*!< Data Output bits mask */

/**
  * @}
  */
/******************************************************************************/
/*                          Peripherals Base Address                          */
/******************************************************************************/
#define OPT_BASE                    (uint16_t)0x4800
#define GPIOA_BASE                  (uint16_t)0x5000
#define GPIOB_BASE                  (uint16_t)0x5005
#define GPIOC_BASE                  (uint16_t)0x500A
#define GPIOD_BASE                  (uint16_t)0x500F
#define GPIOE_BASE                  (uint16_t)0x5014
#define GPIOF_BASE                  (uint16_t)0x5019
#define GPIOG_BASE                  (uint16_t)0x501E
#define GPIOH_BASE                  (uint16_t)0x5023
#define GPIOI_BASE                  (uint16_t)0x5028
#define FLASH_BASE                  (uint16_t)0x5050
#define DMA1_BASE                   (uint16_t)0x5070
#define DMA1_Channel0_BASE          (uint16_t)0x5075
#define DMA1_Channel1_BASE          (uint16_t)0x507F
#define DMA1_Channel2_BASE          (uint16_t)0x5089
#define DMA1_Channel3_BASE          (uint16_t)0x5093
#define SYSCFG_BASE                 (uint16_t)0x509D
#define EXTI_BASE                   (uint16_t)0x50A0
#define WFE_BASE                    (uint16_t)0x50A6
#define RST_BASE                    (uint16_t)0x50B0
#define PWR_BASE                    (uint16_t)0x50B2
#define CLK_BASE                    (uint16_t)0x50C0
#define WWDG_BASE                   (uint16_t)0x50D3
#define IWDG_BASE                   (uint16_t)0x50E0
#define BEEP_BASE                   (uint16_t)0x50F0
#define RTC_BASE                    (uint16_t)0x5140
#define CSSLSE_BASE                 (uint16_t)0x5190
#define SPI1_BASE                   (uint16_t)0x5200
#define SPI2_BASE                   (uint16_t)0x53C0
#define I2C1_BASE                   (uint16_t)0x5210
#define USART1_BASE                 (uint16_t)0x5230
#define USART2_BASE                 (uint16_t)0x53E0
#define USART3_BASE                 (uint16_t)0x53F0
#define TIM2_BASE                   (uint16_t)0x5250
#define TIM3_BASE                   (uint16_t)0x5280
#define TIM1_BASE                   (uint16_t)0x52B0
#define TIM4_BASE                   (uint16_t)0x52E0
#define IRTIM_BASE                  (uint16_t)0x52FF
#define TIM5_BASE                   (uint16_t)0x5300
#define ADC1_BASE                   (uint16_t)0x5340
#define DAC_BASE                    (uint16_t)0x5380
#define AES_BASE                    (uint16_t)0x53D0
#define LCD_BASE                    (uint16_t)0x5400
#define RI_BASE                     (uint16_t)0x5430
#define COMP_BASE                   (uint16_t)0x5440
#define CFG_BASE                    (uint16_t)0x7F60
#define ITC_BASE                    (uint16_t)0x7F70
#define DM_BASE                     (uint16_t)0x7F90

/******************************************************************************/
/*                          Peripherals declarations                          */
/******************************************************************************/


#define SYSCFG                      ((SYSCFG_TypeDef *) SYSCFG_BASE)
#define GPIOA                       ((GPIO_TypeDef *) GPIOA_BASE)
#define GPIOB                       ((GPIO_TypeDef *) GPIOB_BASE)
#define GPIOC                       ((GPIO_TypeDef *) GPIOC_BASE)
#define GPIOD                       ((GPIO_TypeDef *) GPIOD_BASE)
#define GPIOE                       ((GPIO_TypeDef *) GPIOE_BASE)
#define GPIOF                       ((GPIO_TypeDef *) GPIOF_BASE)
#define GPIOG                       ((GPIO_TypeDef *) GPIOG_BASE)
#define GPIOH                       ((GPIO_TypeDef *) GPIOH_BASE)
#define GPIOI                       ((GPIO_TypeDef *) GPIOI_BASE)
#define RTC                         ((RTC_TypeDef *) RTC_BASE)
#define FLASH                       ((FLASH_TypeDef *) FLASH_BASE)
#define EXTI                        ((EXTI_TypeDef *) EXTI_BASE)
#define RST                         ((RST_TypeDef *) RST_BASE)
#define PWR                         ((PWR_TypeDef *) PWR_BASE)
#define CLK                         ((CLK_TypeDef *) CLK_BASE)
#define CSSLSE                      ((CSSLSE_TypeDef *) CSSLSE_BASE)
#define WWDG                        ((WWDG_TypeDef *) WWDG_BASE)
#define IWDG                        ((IWDG_TypeDef *) IWDG_BASE)
#define WFE                         ((WFE_TypeDef *) WFE_BASE)
#define BEEP                        ((BEEP_TypeDef *) BEEP_BASE)
#define SPI1                        ((SPI_TypeDef *) SPI1_BASE)
#define SPI2                        ((SPI_TypeDef *) SPI2_BASE)
#define I2C1                        ((I2C_TypeDef *) I2C1_BASE)
#define USART1                      ((USART_TypeDef *) USART1_BASE)
#define USART2                      ((USART_TypeDef *) USART2_BASE)
#define USART3                      ((USART_TypeDef *) USART3_BASE)
#define LCD                         ((LCD_TypeDef *) LCD_BASE)
#define TIM1                        ((TIM1_TypeDef *) TIM1_BASE)
#define TIM2                        ((TIM_TypeDef *) TIM2_BASE)
#define TIM3                        ((TIM_TypeDef *) TIM3_BASE)
#define TIM4                        ((TIM4_TypeDef *) TIM4_BASE)
#define TIM5                        ((TIM_TypeDef *) TIM5_BASE)
#define IRTIM                       ((IRTIM_TypeDef *) IRTIM_BASE)
#define ITC                         ((ITC_TypeDef *) ITC_BASE)
#define DAC                         ((DAC_TypeDef *) DAC_BASE)
#define DMA1                        ((DMA_TypeDef *) DMA1_BASE)
#define DMA1_Channel0               ((DMA_Channel_TypeDef *) DMA1_Channel0_BASE)
#define DMA1_Channel1               ((DMA_Channel_TypeDef *) DMA1_Channel1_BASE)
#define DMA1_Channel2               ((DMA_Channel_TypeDef *) DMA1_Channel2_BASE)
#define DMA1_Channel3               ((DMA_Channel_TypeDef *) DMA1_Channel3_BASE)
#define DM                          ((DM_TypeDef *) DM_BASE)
#define RI                          ((RI_TypeDef *) RI_BASE)
#define COMP                        ((COMP_TypeDef *) COMP_BASE)
#define AES                         ((AES_TypeDef *) AES_BASE)
#define ADC1                        ((ADC_TypeDef *) ADC1_BASE)
#define CFG                         ((CFG_TypeDef *) CFG_BASE)
#define OPT                         ((OPT_TypeDef *) OPT_BASE)

